{
    "accessibility": null,
    "additionDate": "2025-02-12T15:24:27.882984Z",
    "biotoolsCURIE": "biotools:fmat",
    "biotoolsID": "fmat",
    "collectionID": [],
    "community": null,
    "confidence_flag": "high",
    "cost": null,
    "credit": [],
    "description": "Measuring Propositions in Natural Language.\n\nThe Fill-Mask Association Test (FMAT) is an integrative and probability-based method using Masked Language Models to measure conceptual associations (e.g., attitudes, biases, stereotypes, social norms, cultural values) as propositions in natural language. Supported language models include BERT <doi:10.48550/arXiv.1810.04805> and its variants available at Hugging Face <https://huggingface.co/models?pipeline_tag=fill-mask>. Methodological references and installation guidance are provided at <https://psychbruce.github.io/FMAT/>.\n\nThe Fill-Mask Association Test ('FMAT') is an integrative and probability-based method using Masked Language Models to measure conceptual associations (e.g., attitudes, biases, stereotypes, social norms, cultural values) as propositions in natural language.",
    "documentation": [],
    "download": [],
    "editPermission": {
        "authors": [],
        "type": "public"
    },
    "elixirCommunity": [],
    "elixirNode": [],
    "elixirPlatform": [],
    "elixir_badge": 0,
    "function": [
        {
            "cmd": null,
            "input": [],
            "note": null,
            "operation": [
                {
                    "term": "Text mining",
                    "uri": "http://edamontology.org/operation_0306"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                },
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                }
            ],
            "output": []
        }
    ],
    "homepage": "https://psychbruce.github.io/FMAT/",
    "homepage_status": 0,
    "language": [
        "R"
    ],
    "lastUpdate": "2025-02-13T09:53:29.319171Z",
    "license": "GPL-3.0",
    "link": [
        {
            "note": null,
            "type": [
                "Repository"
            ],
            "url": "https://CRAN.R-project.org/package=FMAT"
        }
    ],
    "maturity": null,
    "name": "FMAT",
    "operatingSystem": [],
    "otherID": [],
    "owner": "curation",
    "publication": [
        {
            "doi": "10.1037/pspa0000396",
            "metadata": {
                "abstract": "Recent advances in large language models are enabling the computational intelligent analysis of psychology in natural language. Here, the Fill-Mask Association Test (FMAT) is introduced as a novel and integrative method leveraging Masked Language Models to study and measure psychology from a propositional perspective at the societal level. The FMAT uses Bidirectional Encoder Representations from Transformers (BERT) models to compute semantic probabilities of option words filling in the masked blank of a designed query (i.e., a clozelike contextualized sentence). The current research presents 15 studies that establish the reliability and validity of the FMAT in predicting factual associations (Studies 1A–1C), measuring attitudes/ biases (Studies 2A–2D), capturing social stereotypes (Studies 3A–3D), and retrospectively delineating lay perceptions of sociocultural changes over time (Studies 4A–4D). Empirically, the FMAT replicated seminal findings previously obtained with human participants (e.g., the Implicit Association Test) and other big-data text-analytic methods (e.g., word frequency analysis, the Word Embedding Association Test), demonstrating robustness across 12 BERT model variants and diverse training text corpora. Theoretically, the current findings substantiate the propositional (vs. associative) perspective on how semantic associations are represented in natural language. Methodologically, the FMAT allows for more fine-grained language-based psychological measurement, with an R package developed to streamline its workflow for use on broader research questions.",
                "authors": [
                    {
                        "name": "Bao H.-W.-S."
                    }
                ],
                "citationCount": 2,
                "date": "2024-07-08T00:00:00Z",
                "journal": "Journal of Personality and Social Psychology",
                "title": "The Fill-Mask Association Test (FMAT): Measuring Propositions in Natural Language"
            },
            "note": null,
            "pmcid": null,
            "pmid": "38976396",
            "type": [],
            "version": null
        }
    ],
    "relation": [],
    "toolType": [],
    "topic": [
        {
            "term": "Natural language processing",
            "uri": "http://edamontology.org/topic_0218"
        },
        {
            "term": "Statistics and probability",
            "uri": "http://edamontology.org/topic_2269"
        },
        {
            "term": "Workflows",
            "uri": "http://edamontology.org/topic_0769"
        },
        {
            "term": "Machine learning",
            "uri": "http://edamontology.org/topic_3474"
        }
    ],
    "validated": 0,
    "version": []
}